tap "clementtsang/bottom"
tap "epk/epk"
tap "federico-terzi/espanso"
tap "gromgit/fuse"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "neovim/neovim"
tap "romkatv/powerlevel10k"
brew "ack"
brew "act"
brew "zstd"
brew "bash"
brew "bat"
brew "bottom"
brew "pycparser", link: false
brew "cffi", link: false
brew "cgal"
brew "chezmoi"
brew "cmus"
brew "coreutils"
brew "curl"
brew "direnv"
brew "dnsmasq"
brew "eza"
brew "fd"
brew "gcc"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "highlight"
brew "httpd", restart_service: :changed
brew "hub"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "libpq"
brew "librsvg"
brew "lsd"
brew "mackup"
brew "make"
brew "markdown"
brew "mise"
brew "moc"
brew "mpc"
brew "mpd", restart_service: :changed
brew "musikcube"
brew "ncmpcpp"
brew "fastfetch"
brew "neovim"
brew "nginx"
brew "node"
brew "nomad"
brew "nu"
brew "nushell"
brew "nvm"
brew "pandoc"
brew "pgcli"
brew "pillow", link: false
brew "powerlevel10k"
brew "protobuf"
brew "pyenv"
brew "python@3.13"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "tailscale"
brew "tealdeer"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "w3m"
brew "wakatime-cli"
brew "weasyprint"
brew "wget"
brew "wtfutil"
brew "yazi"
brew "yq"
brew "z"
brew "zig"
brew "zoxide"
brew "zsh"
brew "federico-terzi/espanso/espanso"
brew "gromgit/fuse/sshfs-mac"
cask "alacritty"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "epk/epk/font-sf-mono-nerd-font"
cask "fuse-t"
cask "kitty"
cask "macfuse"
cask "mp3tag"
cask "wkhtmltopdf"
cask "xquartz"
vscode "ancientlord.nightowl-theme"
vscode "anotherglitchinthematrix.monochrome"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "azemoh.one-monokai"
vscode "bierner.github-markdown-preview"
vscode "colinfang.markdown-julia"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "equinusocio.vsc-material-theme-icons"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "julialang.language-julia"
vscode "mathematic.vscode-pdf"
vscode "mhutchie.git-graph"
vscode "mikehhodgson.monochrome-dark"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "quarto.quarto"
vscode "rokoroku.vscode-theme-darcula"
vscode "sdras.night-owl"
vscode "solarliner.linux-themes"
vscode "tomoki1207.pdf"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "zhuangtongfa.material-theme"
cargo "wasm-bindgen-cli"
cargo "wasm-pack"
uv "jinja2-cli"
